app/views/forums/index.html.erb

      <% @ranking.each do |a| %>
        <% foro = Forum.find(a[0]) %>
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]