app/views/articles/show.html.erb


              <% if User.find(comment.op_id).avatar_url == "" %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]