app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
---
          <h4 class="card-title"><strong>Comentarios</h4></strong>
          <% @article.comments.each do |comment| %>