app/views/users/show.html.erb

                    <h4><%= @user.first_name%> <%= @user.last_name%> <small><i><%= @user.email %></i></small></h4>
                    <% article = Article.find(vote.article_id) %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" IN (9, 1, 7)