app/controllers/articles_controller.rb

  def show
    @article = @forum.articles.find_by!(id: params[:id]) if @forum
    @comments = @article.comments.paginate(:page => params[:page], :per_page => 6)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."forum_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["forum_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]

  def index
    if params[:search]
      @articles = Article.paginate(:page => params[:page], :per_page => 2).where(['name LIKE ?',"%#{params[:search]}%"])
      respond_to do |format|
        format.html
        format.js
    end
    else
    @articles = @forum.articles.all
---
SELECT  "articles".* FROM "articles" WHERE "articles"."forum_id" = $1 AND "articles"."id" IS NULL LIMIT $2  [["forum_id", 1], ["LIMIT", 1]]

  def downvote
   @article = @forum.articles.find_by!(id: params[:id]) if @forum
---
SELECT  "articles".* FROM "articles" WHERE "articles"."forum_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["forum_id", 1], ["id", 1], ["LIMIT", 1]]

  def upvote
    @article = @forum.articles.find_by!(id: params[:id]) if @forum
---
SELECT  "articles".* FROM "articles" WHERE "articles"."forum_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["forum_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    @article = Article.new(article_params)
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "op", "forum_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "Articulo 1.2"], ["body", "cambiado"], ["updated_at", "2018-05-12 13:23:31.028942"], ["id", 2]]

  def destroy
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]

    def set_forum_article
      @article = @forum.articles.find_by!(id: params[:id]) if @forum
---
SELECT  "articles".* FROM "articles" WHERE "articles"."forum_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["forum_id", 1], ["id", 4], ["LIMIT", 1]]

    def set_forum
      @forum = Forum.find(params[:forum_id])
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]