app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def show
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("op", "content", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["op", "fobrunner@uc.cl"], ["content", "Chama es bacan"], ["article_id", 1], ["created_at", "2018-04-28 20:26:20.595127"], ["updated_at", "2018-04-28 20:26:20.595127"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "Otro. editado"], ["updated_at", "2018-05-12 00:07:20.600007"], ["id", 26]]
---
  def update
      if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
  def destroy
    @comment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["article_id", 2], ["id", 26], ["LIMIT", 1]]
---
    def set_article_comment
      @comment = @article.comments.find_by!(id: params[:id]) if @article

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_forum_article
      @forum = Forum.find(params[:forum_id])
      @article = Article.find(params[:article_id])