app/controllers/forums_controller.rb

SELECT "forums".* FROM "forums" WHERE (name LIKE '%Tercer Foro%')
SELECT  "forums".* FROM "forums" LIMIT $1  [["LIMIT", 11]]
---
  def index
    @ranking = Admin.select("forum_id").group(:forum_id).order("count(nullif(subscribe, false)) desc").count( "nullif(subscribe, false)")

    if params[:search]
      @forums = Forum.paginate(:page => params[:page], :per_page => 3).where(['lower(name) ILIKE ?',"%#{params[:search]}%"])
      respond_to do |format|
        format.html
        format.js
      end
    else
      @forums = Forum.all

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @forum = Forum.find(params[:id])

INSERT INTO "forums" ("name", "op", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Foro 1"], ["op", "fjlarach@uc.cl"], ["description", "Mi primer foro"], ["created_at", "2018-05-11 19:51:11.883418"], ["updated_at", "2018-05-11 19:51:11.883418"]]
---
  def create
    @forum = Forum.new(forum_params.except(:email, :forum_id))
    respond_to do |format|
      if @forum.save

UPDATE "forums" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "forums"."id" = $4  [["name", "Foro 2.1"], ["description", "Se trata del segundo foro, pero editado"], ["updated_at", "2018-05-12 13:41:22.539018"], ["id", 3]]
---
  def update
      if @forum.update(forum_params.except(:email, :forum_id))

DELETE FROM "forums" WHERE "forums"."id" = $1  [["id", 1]]
---
  def destroy
    @forum.destroy

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_forum
      @forum = Forum.find(params[:id])